MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx764f128l.h
extern volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs"), address(0xBF88B230)));
extern volatile uint32_t        C1RXF15CLR __attribute__((section("sfrs"),address(0xBF88B234)));
extern volatile uint32_t        C1RXF15SET __attribute__((section("sfrs"),address(0xBF88B238)));
extern volatile uint32_t        C1RXF15INV __attribute__((section("sfrs"),address(0xBF88B23C)));
#define C1RXF16 C1RXF16
extern volatile uint32_t   C1RXF16 __attribute__((section("sfrs"), address(0xBF88B240)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF16bits_t;
extern volatile __C1RXF16bits_t C1RXF16bits __asm__ ("C1RXF16") __attribute__((section("sfrs"), address(0xBF88B240)));
extern volatile uint32_t        C1RXF16CLR __attribute__((section("sfrs"),address(0xBF88B244)));
extern volatile uint32_t        C1RXF16SET __attribute__((section("sfrs"),address(0xBF88B248)));
extern volatile uint32_t        C1RXF16INV __attribute__((section("sfrs"),address(0xBF88B24C)));
#define C1RXF17 C1RXF17
extern volatile uint32_t   C1RXF17 __attribute__((section("sfrs"), address(0xBF88B250)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF17bits_t;
extern volatile __C1RXF17bits_t C1RXF17bits __asm__ ("C1RXF17") __attribute__((section("sfrs"), address(0xBF88B250)));
extern volatile uint32_t        C1RXF17CLR __attribute__((section("sfrs"),address(0xBF88B254)));
extern volatile uint32_t        C1RXF17SET __attribute__((section("sfrs"),address(0xBF88B258)));
extern volatile uint32_t        C1RXF17INV __attribute__((section("sfrs"),address(0xBF88B25C)));
#define C1RXF18 C1RXF18
extern volatile uint32_t   C1RXF18 __attribute__((section("sfrs"), address(0xBF88B260)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF18bits_t;
extern volatile __C1RXF18bits_t C1RXF18bits __asm__ ("C1RXF18") __attribute__((section("sfrs"), address(0xBF88B260)));
extern volatile uint32_t        C1RXF18CLR __attribute__((section("sfrs"),address(0xBF88B264)));
extern volatile uint32_t        C1RXF18SET __attribute__((section("sfrs"),address(0xBF88B268)));
extern volatile uint32_t        C1RXF18INV __attribute__((section("sfrs"),address(0xBF88B26C)));
#define C1RXF19 C1RXF19
extern volatile uint32_t   C1RXF19 __attribute__((section("sfrs"), address(0xBF88B270)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF19bits_t;
extern volatile __C1RXF19bits_t C1RXF19bits __asm__ ("C1RXF19") __attribute__((section("sfrs"), address(0xBF88B270)));
extern volatile uint32_t        C1RXF19CLR __attribute__((section("sfrs"),address(0xBF88B274)));
extern volatile uint32_t        C1RXF19SET __attribute__((section("sfrs"),address(0xBF88B278)));
extern volatile uint32_t        C1RXF19INV __attribute__((section("sfrs"),address(0xBF88B27C)));
#define C1RXF20 C1RXF20
extern volatile uint32_t   C1RXF20 __attribute__((section("sfrs"), address(0xBF88B280)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF20bits_t;
extern volatile __C1RXF20bits_t C1RXF20bits __asm__ ("C1RXF20") __attribute__((section("sfrs"), address(0xBF88B280)));
extern volatile uint32_t        C1RXF20CLR __attribute__((section("sfrs"),address(0xBF88B284)));
extern volatile uint32_t        C1RXF20SET __attribute__((section("sfrs"),address(0xBF88B288)));
extern volatile uint32_t        C1RXF20INV __attribute__((section("sfrs"),address(0xBF88B28C)));
#define C1RXF21 C1RXF21
extern volatile uint32_t   C1RXF21 __attribute__((section("sfrs"), address(0xBF88B290)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF21bits_t;
extern volatile __C1RXF21bits_t C1RXF21bits __asm__ ("C1RXF21") __attribute__((section("sfrs"), address(0xBF88B290)));
extern volatile uint32_t        C1RXF21CLR __attribute__((section("sfrs"),address(0xBF88B294)));
extern volatile uint32_t        C1RXF21SET __attribute__((section("sfrs"),address(0xBF88B298)));
extern volatile uint32_t        C1RXF21INV __attribute__((section("sfrs"),address(0xBF88B29C)));
#define C1RXF22 C1RXF22
extern volatile uint32_t   C1RXF22 __attribute__((section("sfrs"), address(0xBF88B2A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF22bits_t;
extern volatile __C1RXF22bits_t C1RXF22bits __asm__ ("C1RXF22") __attribute__((section("sfrs"), address(0xBF88B2A0)));
extern volatile uint32_t        C1RXF22CLR __attribute__((section("sfrs"),address(0xBF88B2A4)));
extern volatile uint32_t        C1RXF22SET __attribute__((section("sfrs"),address(0xBF88B2A8)));
extern volatile uint32_t        C1RXF22INV __attribute__((section("sfrs"),address(0xBF88B2AC)));
#define C1RXF23 C1RXF23
extern volatile uint32_t   C1RXF23 __attribute__((section("sfrs"), address(0xBF88B2B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF23bits_t;
extern volatile __C1RXF23bits_t C1RXF23bits __asm__ ("C1RXF23") __attribute__((section("sfrs"), address(0xBF88B2B0)));
extern volatile uint32_t        C1RXF23CLR __attribute__((section("sfrs"),address(0xBF88B2B4)));
extern volatile uint32_t        C1RXF23SET __attribute__((section("sfrs"),address(0xBF88B2B8)));
extern volatile uint32_t        C1RXF23INV __attribute__((section("sfrs"),address(0xBF88B2BC)));
#define C1RXF24 C1RXF24
extern volatile uint32_t   C1RXF24 __attribute__((section("sfrs"), address(0xBF88B2C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF24bits_t;
extern volatile __C1RXF24bits_t C1RXF24bits __asm__ ("C1RXF24") __attribute__((section("sfrs"), address(0xBF88B2C0)));
extern volatile uint32_t        C1RXF24CLR __attribute__((section("sfrs"),address(0xBF88B2C4)));
extern volatile uint32_t        C1RXF24SET __attribute__((section("sfrs"),address(0xBF88B2C8)));
extern volatile uint32_t        C1RXF24INV __attribute__((section("sfrs"),address(0xBF88B2CC)));
#define C1RXF25 C1RXF25
extern volatile uint32_t   C1RXF25 __attribute__((section("sfrs"), address(0xBF88B2D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF25bits_t;
extern volatile __C1RXF25bits_t C1RXF25bits __asm__ ("C1RXF25") __attribute__((section("sfrs"), address(0xBF88B2D0)));
extern volatile uint32_t        C1RXF25CLR __attribute__((section("sfrs"),address(0xBF88B2D4)));
extern volatile uint32_t        C1RXF25SET __attribute__((section("sfrs"),address(0xBF88B2D8)));
extern volatile uint32_t        C1RXF25INV __attribute__((section("sfrs"),address(0xBF88B2DC)));
#define C1RXF26 C1RXF26
extern volatile uint32_t   C1RXF26 __attribute__((section("sfrs"), address(0xBF88B2E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF26bits_t;
extern volatile __C1RXF26bits_t C1RXF26bits __asm__ ("C1RXF26") __attribute__((section("sfrs"), address(0xBF88B2E0)));
extern volatile uint32_t        C1RXF26CLR __attribute__((section("sfrs"),address(0xBF88B2E4)));
extern volatile uint32_t        C1RXF26SET __attribute__((section("sfrs"),address(0xBF88B2E8)));
extern volatile uint32_t        C1RXF26INV __attribute__((section("sfrs"),address(0xBF88B2EC)));
#define C1RXF27 C1RXF27
extern volatile uint32_t   C1RXF27 __attribute__((section("sfrs"), address(0xBF88B2F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF27bits_t;
